test/data/test-cholesterol.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:kron="http://kroniker.service.kihdb.silverbullet.dk/" xmlns:urn="urn:oio:medcom:chronic-dataset:1.0.0" xmlns:ns="http://rep.oio.dk/medcom.dk/xml/schemas/2011/06/20/">
    <soapenv:Header/>
    <soapenv:Body>
        <kron:UploadChronicDataset>
            <!--Optional:-->
            <urn:UploadChronicDatasetRequestMessage>
                <ns:MedComKD>
                    <ns:Borger>
                        <ns:CPR>2512484916</ns:CPR>
                        <ns:Fornavn>Nancy</ns:Fornavn>
                        <ns:Efternavn>Berggren</ns:Efternavn>
                        <ns:FoedselsDato>1948-12-25</ns:FoedselsDato>
                        <ns:Koen>K</ns:Koen>
                        <ns:Vej>Skovvejen 12</ns:Vej>
                        <ns:Postnummer>8010</ns:Postnummer>
                        <ns:By>Aarhus N</ns:By>
                        <ns:Kontakttelefon>86121824</ns:Kontakttelefon>
                        <ns:eMail>nb@meail.dk</ns:eMail>
                    </ns:Borger>
                    <ns:MonitoreringOgMaal>
                        <!--Zero or more repetitions:-->
                        <ns:Kolesterol>
                            <ns:ID>e6aced22-6de0-11e1-b0c4-0800200c9a66</ns:ID>
                            <ns:Dato>2010-11-28T12:33:00</ns:Dato>
                            <ns:AnalyseID>765432219</ns:AnalyseID>
                            <ns:SamletKolesterol>
                                <ns:IUPAC>NPU01566</ns:IUPAC>
                                <ns:Analyse>Samlet Kolesterol</ns:Analyse>
                                <ns:Resultat>5</ns:Resultat>
                                <ns:Enhed>mmol/l</ns:Enhed>
                                <ns:Min>1</ns:Min>
                                <ns:Max>6</ns:Max>
                                <ns:Abnorm>Normal</ns:Abnorm>
                                <ns:PatientensMaal>5</ns:PatientensMaal>
                            </ns:SamletKolesterol>
                            <ns:HDL>
                                <ns:IUPAC>NPU01567</ns:IUPAC>
                                <ns:Analyse>HDL High-density cholesterol</ns:Analyse>
                                <ns:Resultat>1</ns:Resultat>
                                <ns:Enhed>mmol/l</ns:Enhed>
                                <ns:Min>1</ns:Min>
                                <ns:Abnorm>Normal</ns:Abnorm>
                                <ns:PatientensMaal>3</ns:PatientensMaal>
                            </ns:HDL>
                            <ns:LDL>
                                <ns:IUPAC>NPU01568</ns:IUPAC>
                                <ns:Analyse>LDL Low-density cholesterol</ns:Analyse>
                                <ns:Resultat>3</ns:Resultat>
                                <ns:Enhed>mmol/l</ns:Enhed>
                                <ns:Min>0</ns:Min>
                                <ns:Max>5</ns:Max>
                                <ns:Abnorm>Normal</ns:Abnorm>
                                <ns:PatientensMaal>2,5</ns:PatientensMaal>
                            </ns:LDL>
                            <ns:Triglycerid>
                                <ns:IUPAC>NPU04094</ns:IUPAC>
                                <ns:Analyse>LDL Low-density cholesterol</ns:Analyse>
                                <ns:Resultat>0,3</ns:Resultat>
                                <ns:Enhed>mmol/l</ns:Enhed>
                                <ns:Min>0</ns:Min>
                                <ns:Max>2</ns:Max>
                                <ns:Abnorm>Normal</ns:Abnorm>
                                <ns:PatientensMaal>0,3</ns:PatientensMaal>
                            </ns:Triglycerid>
                            <ns:UdfoertAf>OUH, afd M</ns:UdfoertAf>
                        </ns:Kolesterol>
                    </ns:MonitoreringOgMaal>
                </ns:MedComKD>
            </urn:UploadChronicDatasetRequestMessage>
        </kron:UploadChronicDataset>
    </soapenv:Body>
</soapenv:Envelope>